<unk>	0
<s>	0
</s>	0
▁	-2.05008
_	-2.79981
▁*	-3.34358
/	-3.4276
▁/*	-3.55777
e	-3.62242
)	-4.12281
;	-4.17892
i	-4.2759
o	-4.32381
n	-4.33931
t	-4.3518
s	-4.44595
ptr	-4.46346
.	-4.4882
l	-4.51354
}	-4.51538
▁-	-4.54347
▁(	-4.5591
▁the	-4.69304
X	-4.72198
packet	-4.73031
E	-4.82293
▁=	-4.83264
***************	-4.88824
=	-4.89337
N	-4.89738
▁N	-4.94478
r	-4.95281
a	-4.97124
▁pointer	-4.98268
{	-5.02614
x	-5.02614
▁checksum	-5.05558
>	-5.07161
ip	-5.08306
,	-5.11923
u	-5.15456
6	-5.16749
short	-5.16923
if	-5.1712
to	-5.17266
p	-5.21226
S	-5.27619
ng	-5.34295
of	-5.34374
de	-5.3462
I	-5.39314
R	-5.39793
current	-5.39874
end	-5.39905
inc	-5.39967
▁s	-5.42716
it	-5.439
▁a	-5.45179
▁is	-5.47017
int	-5.49978
▁packet	-5.51826
C	-5.53435
F	-5.53681
length	-5.53683
▁supp	-5.53684
st	-5.54655
**************	-5.5614
checksum	-5.56301
ress	-5.61382
lo	-5.64973
h	-5.66597
▁n	-5.69168
4	-5.69708
USHORT	-5.69709
▁necessary	-5.69709
▁cas	-5.69726
0	-5.75058
P	-5.78318
G	-5.788
{92	-5.78801
ed	-5.81054
lu	-5.82476
((	-5.84178
▁in	-5.84461
f	-5.85511
L	-5.8869
PACKET	-5.888
DI	-5.89179
▁&	-5.91228
(	-5.91954
g	-5.98622
rc	-5.98997
-	-5.99454
c	-5.99788
m	-5.999
2	-5.99908
TYPE	-5.99911
7	-5.99911
ABLE	-5.99911
b	-5.99911
V	-5.99911
AL	-6.00033
IP	-6.00482
es	-6.02675
▁0	-6.04733
▁data	-6.08177
D	-6.10997
O	-6.11741
w	-6.12392
addr	-6.12411
"	-6.12411
▁address	-6.12411
CHAIN	-6.12413
def	-6.13219
der	-6.14153
▁byte	-6.1554
▁ULONG	-6.17618
v	-6.2572
T	-6.25854
1	-6.26442
Y	-6.26697
tmp	-6.26706
ver	-6.26717
protocol	-6.26828
endif	-6.28179
d	-6.34069
3	-6.43118
9	-6.43359
M	-6.43362
8	-6.43363
y	-6.43363
[	-6.43363
]	-6.43363
▁IPv	-6.43404
pre	-6.43427
AT	-6.43497
UR	-6.43591
va	-6.44464
*	-6.44914
al	-6.47964
data	-6.49434
ud	-6.60852
▁/**	-6.63323
16)	-6.63378
two	-6.63393
ate	-6.63493
he	-6.70446
ro	-6.70655
ra	-6.83489
us	-6.83535
▁th	-6.8625
A	-6.87282
nd	-6.87328
CHA	-6.8836
UINT	-6.88363
ction	-6.88363
size	-6.88363
|	-6.88363
FFF	-6.88367
{94	-6.88367
ION	-6.88372
UT	-6.88521
▁co	-6.88804
TO	-6.88832
AS	-6.88948
▁Th	-6.89092
CO	-6.89325
▁or	-6.89591
cu	-6.89932
pp	-6.91278
▁comput	-6.96782
erat	-6.98013
ULONG	-7.07667
U	-7.20985
icense	-7.21696
H	-7.21697
<	-7.21697
NULL	-7.21697
struct	-7.21697
▁Zhou	-7.21697
ICMP	-7.21697
term	-7.21698
▁else	-7.21698
MIT	-7.21699
▁whi	-7.21699
202	-7.217
cros	-7.21703
&	-7.57948
!	-7.71697
:	-7.71697
W	-7.71697
k	-7.71697
~	-8.71647
Z	-8.71657
z	-8.71667
B	-8.71677
#	-8.71687
'	-8.71697
+	-8.71697
K	-8.71697
